# Pandas cleaning Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("data/survey_results_public.csv")

pd.set_option("display.max_columns", 85)
pd.set_option("display.max_rows", 85)

In [3]:
df1 = pd.read_csv("csv_file.csv")

In [6]:
students = {
    "first_name" : ["Shashi", "Meet", "Anshuman", "Prashant", "Vikhil"],
    "last_name" : ["NA", "Thakar", "Tiwari", "Vasala", np.nan],
    "Roll-no" : [46, None, 65, np.nan, 50], 
    "email" : ["shashiprajapati38@gmail.com", "Missing", "anshuman@gmail.com", "prashant@gmail.com", "vikhil@gmail.com"]
}

In [7]:
df2 = pd.DataFrame(students)

In [8]:
df2

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
1       Meet    Thakar      NaN                      Missing
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
3   Prashant    Vasala      NaN           prashant@gmail.com
4     Vikhil       NaN     50.0             vikhil@gmail.com

In [9]:
df2.dropna()    # rows containing NaN drops

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
2   Anshuman    Tiwari     65.0           anshuman@gmail.com

In [11]:
df2.dropna(axis="index",how="any")  # axis can be index or columns, and how can have any or all

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
2   Anshuman    Tiwari     65.0           anshuman@gmail.com

In [12]:
df2.dropna(axis="index",how="all")   # this will drop the rows, if rows containing all NaN values

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
1       Meet    Thakar      NaN                      Missing
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
3   Prashant    Vasala      NaN           prashant@gmail.com
4     Vikhil       NaN     50.0             vikhil@gmail.com

In [13]:
df2.dropna(axis="columns",how="any")  # if any columns contains NaN value, it will drop that particular column

  first_name                        email
0     Shashi  shashiprajapati38@gmail.com
1       Meet                      Missing
2   Anshuman           anshuman@gmail.com
3   Prashant           prashant@gmail.com
4     Vikhil             vikhil@gmail.com

In [14]:
df2.dropna(axis="columns",how="all")    # It will drop the columns, if all the values in that column is NaN

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
1       Meet    Thakar      NaN                      Missing
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
3   Prashant    Vasala      NaN           prashant@gmail.com
4     Vikhil       NaN     50.0             vikhil@gmail.com

In [15]:
df2.dropna(axis="index",how="any", subset=["email"])   # if email is filled, it won't drop that row

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
1       Meet    Thakar      NaN                      Missing
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
3   Prashant    Vasala      NaN           prashant@gmail.com
4     Vikhil       NaN     50.0             vikhil@gmail.com

In [16]:
df2.dropna(axis="index",how="any", subset=["Roll-no"])  # Student doesn't containing roll-no dropped

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
4     Vikhil       NaN     50.0             vikhil@gmail.com

In [18]:
df2.dropna(axis="index",how="all", subset=["last_name", "Roll-no"])   # if student doesnot have both last_name and roll will be
# deleted

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
1       Meet    Thakar      NaN                      Missing
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
3   Prashant    Vasala      NaN           prashant@gmail.com
4     Vikhil       NaN     50.0             vikhil@gmail.com

In [19]:
df2.dropna(axis="index",how="any", subset=["last_name", "Roll-no"])  # if student doesnot have any last_name and roll will be
# not be deleted

  first_name last_name  Roll-no                        email
0     Shashi        NA     46.0  shashiprajapati38@gmail.com
2   Anshuman    Tiwari     65.0           anshuman@gmail.com

replace NA, Missing with NaN

In [21]:
df2.replace("NA", np.nan, inplace=True)
df2.replace("Missing", np.nan, inplace=True)

In [22]:
df2

  first_name last_name  Roll-no                        email
0     Shashi       NaN     46.0  shashiprajapati38@gmail.com
1       Meet    Thakar      NaN                          NaN
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
3   Prashant    Vasala      NaN           prashant@gmail.com
4     Vikhil       NaN     50.0             vikhil@gmail.com

In [24]:
df2.fillna("MISSING")

  first_name last_name  Roll-no                        email
0     Shashi   MISSING       46  shashiprajapati38@gmail.com
1       Meet    Thakar  MISSING                      MISSING
2   Anshuman    Tiwari       65           anshuman@gmail.com
3   Prashant    Vasala  MISSING           prashant@gmail.com
4     Vikhil   MISSING       50             vikhil@gmail.com

In [26]:
df2.fillna(0)

  first_name last_name  Roll-no                        email
0     Shashi         0     46.0  shashiprajapati38@gmail.com
1       Meet    Thakar      0.0                            0
2   Anshuman    Tiwari     65.0           anshuman@gmail.com
3   Prashant    Vasala      0.0           prashant@gmail.com
4     Vikhil         0     50.0             vikhil@gmail.com

In [27]:
df2.dtypes

first_name     object
last_name      object
Roll-no       float64
email          object
dtype: object

In [28]:
df2["Roll-no"].mean()

53.666666666666664

In [32]:
df2.fillna("MISSING")

  first_name last_name  Roll-no                        email
0     Shashi   MISSING       46  shashiprajapati38@gmail.com
1       Meet    Thakar  MISSING                      MISSING
2   Anshuman    Tiwari       65           anshuman@gmail.com
3   Prashant    Vasala  MISSING           prashant@gmail.com
4     Vikhil   MISSING       50             vikhil@gmail.com

In [34]:
df2.dtypes

first_name     object
last_name      object
Roll-no       float64
email          object
dtype: object

In [39]:
df2["Roll-no"] = df2["Roll-no"].astype(float)  # we can convert object into float by this method if there

In [40]:
df2["Roll-no"].mean()

53.666666666666664

# Working on Large dataSet (df)

In [42]:
df["YearsCode"]

0          4
1        NaN
2          3
3          3
4         16
        ...
88878    NaN
88879    NaN
88880    NaN
88881    NaN
88882      8
Name: YearsCode, Length: 88883, dtype: object

In [43]:
df["YearsCode"].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [45]:
df["YearsCode"].replace({"Less than 1 year":0, "More than 50 years":51}, inplace=True)

In [46]:
df["YearsCode"].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 51, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)

In [47]:
df["YearsCode"] = df["YearsCode"].astype(float)

In [49]:
df["YearsCode"]

0         4.0
1         NaN
2         3.0
3         3.0
4        16.0
         ...
88878     NaN
88879     NaN
88880     NaN
88881     NaN
88882     8.0
Name: YearsCode, Length: 88883, dtype: float64

In [54]:
df["YearsCode"].agg(['average', 'mean', 'median'])

average          NaN
mean       11.662114
median      9.000000
Name: YearsCode, dtype: float64